USE [RKC]
GO

INSERT INTO Calc.ClosedPeriods
	VALUES ('20200601');

INSERT INTO [CD].[Scales] ([Name])
	VALUES (N'Сутки'), (N'День'), (N'Ночь'), (N'Единый')

INSERT INTO [CD].[Units] ([Name])
	VALUES (N'кВт.ч'), (N'Гкал'), (N'куб.м'), (N'кв.м'), (N'тчк'), (N'руб.')

INSERT INTO [CD].[IndicatorTypes] ([Name],[UnitID])
	VALUES (N'Электроэнергия', 1),(N'Отопление', 2),(N'ХВС', 3),(N'ГВС', 3),(N'Водоотведение', 3),
			(N'Содержание жилья', 4),(N'Домофон', 5),(N'Лифт', 4),(N'Вывоз ТКО', 3),(N'Кап. ремонт', 4)

INSERT INTO [CD].[CalculationMethods] ([Name])
	VALUES (N'Счетчик'), (N'Норматив'), (N'Площадь'), (N'Количество проживающих'), (N'Договорное потребление')

INSERT INTO [CD].[Tariffs] ([DateBegin],[Name],[Value])
     VALUES ('2020-05-01', N'Электроэнергия (день)', 3.12), ('2020-05-01', N'Электроэнергия (ночь)', 1.08), ('2020-05-01', N'Электроэнергия (сутки)', 2.67),
			('2020-05-01', N'Отопление', 2037.69), ('2020-05-01', N'ХВС', 35.00), ('2020-05-01', N'ГВС', 90.00),
			('2020-05-01', N'Водоотведение', 35.00), ('2020-05-01', N'Тариф на содержание жилья', 21.00), ('2020-05-01', N'Обслуживание домофона', 45.00),
			('2020-05-01', N'Вывоз ТКО', 665.38), ('2020-05-01', N'Взнос на капитальный ремонт', 6.88),
			('2020-05-01', 'Обслуживание лифта', 12)

INSERT INTO [CD].[Normatives] ([DateBegin],[Name],[Value])
     VALUES ('2020-05-01', N'Электроэнергия (день)', 77.5), ('2020-05-01', N'Электроэнергия (ночь)', 77.5), ('2020-05-01', N'Электроэнергия (сутки)', 77.5),
			('2020-05-01', N'Отопление', 0.028300), ('2020-05-01', N'ХВС', 6.264000), ('2020-05-01', N'ГВС', 2.910000),
			('2020-05-01', N'Обращение с ТКО', 0.23541)
GO

